// TODOs Завдання: Перевірка паліндрому
// * Опис:
// * Напишіть функцію, яка перевіряє, чи є задане слово паліндромом
// * (тобто словом, яке читається однаково зліва направо і справа наліво).

// * Вимоги:
// * 1. Функція повинна приймати рядок як аргумент.
// * 2. Функція має перевіряти, чи однаковий рядок і його реверс.
// * 3. Якщо слово є паліндромом — повернути або вивести "Вірне слово".
// * 4. Якщо не паліндром — повернути або вивести "Не паліндром".
// * 5. Не можна змінювати оригінальний рядок (тільки використовувати методи JS для роботи з масивами).

function polyndrom(word) {
	const reverseWord = word.split('').reverse().join('');

	if (reverseWord === word) {
		return 'Вірне слово';
	} else {
		return 'Не поліндром';
	}
}

console.log(polyndrom('hello'));
console.log(polyndrom('radar'));
