// TODOs Завдання: Перевірка паліндрому
// * Опис:
// * Напишіть функцію, яка перевіряє, чи є задане слово паліндромом
// * (тобто словом, яке читається однаково зліва направо і справа наліво).
// * Вимоги:
// * 1. Функція повинна приймати рядок як аргумент.
// * 2. Функція має перевіряти, чи однаковий рядок і його реверс.
// * 3. Якщо слово є паліндромом — повернути або вивести "Вірне слово".
// * 4. Якщо не паліндром — повернути або вивести "Не паліндром".
// * 5. Не можна змінювати оригінальний рядок (тільки використовувати методи JS для роботи з масивами).
function polyndrom(word) {
    const reverseWord = word.split('').reverse().join('');
    if (reverseWord === word) return "\u0412\u0456\u0440\u043D\u0435 \u0441\u043B\u043E\u0432\u043E";
    else return "\u041D\u0435 \u043F\u043E\u043B\u0456\u043D\u0434\u0440\u043E\u043C";
}
console.log(polyndrom('hello'));
console.log(polyndrom('radar'));

//# sourceMappingURL=js-task.adb47097.js.map
